{
  "backend/main.mo": "Motoko actor that stores study session records (subject, topic, duration, timestamp) in a map with auto-incrementing IDs, exposing addSession, getAllSessions, and getSession endpoints.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (hold-to-terminate fix, onboarding expansion, settings page, branding removal) to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key behaviors of every component, page, hook, and utility in the project.",
  "frontend/.env.example": "Example environment file noting that no external API keys are required since the app runs fully offline with local databases.",
  "frontend/CLEAN_REDEPLOY.md": "Guide describing when and how to perform a clean rebuild and redeploy of the frontend, listing prerequisites and step-by-step instructions.",
  "frontend/index.css": "Root Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes, including color tokens for background, foreground, card, border, and chart variables.",
  "frontend/index.html": "HTML entry point for the app titled 'AXIOM', mounting the React app at the #root div and loading the main TypeScript module.",
  "frontend/REGRESSION_CHECKLIST.md": "Comprehensive regression testing checklist covering layout, navigation, dashboard content, all feature pages, data persistence, and OLED/theme behavior to verify after any rebuild or deployment.",
  "frontend/scripts/clean-rebuild.sh": "Bash script that removes dist, node_modules, vite cache, and lock file, then reinstalls dependencies, runs a TypeScript check, and rebuilds the project from scratch.",
  "frontend/src/App.tsx": "Root React component wrapping the app in ThemeProvider and OnboardingGate, managing page state for six pages (dashboard, study, gym, nutrition, goals, settings) and rendering BottomNav.",
  "frontend/src/components/ApiKeySettings.tsx": "Empty file with no content.",
  "frontend/src/components/ApiNinjasRepromptGate.tsx": "Empty file with no content.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with six tabs (Home, Study, Gym, Food, Goals, Settings) showing a neon-green active indicator line and icon scale animation for the selected page.",
  "frontend/src/components/CaloriesBurnedApiKeySettings.tsx": "Empty file with no content.",
  "frontend/src/components/HeaderMeasurements.tsx": "Component that reads weekly and monthly body measurements from the Zustand store and renders them in a compact labeled grid, hidden when no data is present.",
  "frontend/src/components/InboundSignalOverlay.tsx": "A fixed top overlay notification that displays an incoming signal/call with the caller's name, auto-dismisses after 4 seconds with a fade-out animation, and includes a manual close button.",
  "frontend/src/components/LiveCalendarWidget.tsx": "A widget that displays a live-updating clock (updating every second), the current date, and a personalized greeting with a calendar icon button for triggering an edit action.",
  "frontend/src/components/MeasurementsEditorDialog.tsx": "A dialog component with weekly and monthly tabs that allows users to edit and save body measurements (chest, waist, butt, etc.) using draft state synced from the global app store.",
  "frontend/src/components/OledModeToggle.tsx": "A toggle button component that enables/disables OLED mode and, when active, shows a color picker dropdown to select an accent color from predefined options, with neon glow styling.",
  "frontend/src/components/OnboardingGate.tsx": "A gate component that shows a profile initialization form (name, age, gender) before rendering children; once onboarding is completed and stored, it passes through to the main app.",
  "frontend/src/components/OpenFoodFactsKeySettings.tsx": "An empty file with no content or exports.",
  "frontend/src/components/ParsedMealPreview.tsx": "Displays a parsed meal's detected food items with individual nutrition details (calories, protein, sugar) and a summary totals section, sourced from local nutrition data.",
  "frontend/src/components/ProtocolModeStartDialog.tsx": "A dialog that collects a subject and topic from the user to initiate a 'Protocol Mode' focus session, with styled inputs and cancel/initiate buttons.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider component and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and persisted identity across page reloads.",
  "frontend/src/hooks/useLongPress.ts": "Custom hook that detects long-press interactions on both mouse and touch events, exposing progress (0–1) and isPressed state over a configurable duration before firing an onLongPress callback.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder file noting that the app uses Zustand for local state management instead of backend queries.",
  "frontend/src/hooks/useResultCountdowns.ts": "Hook that computes and live-updates weekly and monthly countdown values (in days) based on the user's start timestamp, refreshing every minute.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based CSS custom properties for a dark/OLED theme, plus utility classes for neon colors, glow effects, and app canvas constraints.",
  "frontend/src/lib/apiKey.ts": "Empty file, likely a placeholder for API key management utilities.",
  "frontend/src/lib/calories.ts": "Provides a calorie-burn calculation utility using MET values for cardio activities and a weight-based formula for gym exercises, based on a hardcoded user profile.",
  "frontend/src/lib/caloriesBurnedApi.ts": "Empty file, likely a placeholder for a calories-burned API integration.",
  "frontend/src/lib/caloriesBurnedKey.ts": "Empty file, likely a placeholder for storing a calories-burned API key.",
  "frontend/src/lib/countdowns.ts": "Utility functions that calculate days remaining in the current 7-day and 30-day cycles relative to a user's start timestamp, with calendar-based fallbacks when no timestamp is available.",
  "frontend/src/lib/deepseek.ts": "Empty file, likely a placeholder for DeepSeek AI API integration.",
  "frontend/src/lib/descriptionFlow.ts": "Orchestrates parsing a free-text meal description into structured food entries and enriching each entry with local nutrition data including calories, protein, and sugar.",
  "frontend/src/lib/indianNutrition.ts": "Local nutrition database for common Indian foods and branded products, with a lookup function that returns per-quantity calorie, protein, and sugar values via exact or partial name matching.",
  "frontend/src/lib/mealPromptParser.ts": "Parses a free-text meal prompt into multiple structured food items by extracting quantities, units, and food names, then converting units to grams using portion estimates.",
  "frontend/src/lib/mevsa.ts": "Provides a local nutrition database (calories, protein, sugar per 100g for common foods) and an exercise database, with a lookup function that returns scaled nutrition data for a given food and quantity.",
  "frontend/src/lib/nutrition.ts": "Fetches nutrition data for a food item by querying the Indian nutrition database, then the Mevsa database, and finally falling back to a basic calorie estimation.",
  "frontend/src/lib/nutritionix.ts": "Empty file with no content.",
  "frontend/src/lib/onlineNutrition.ts": "Empty file with no content.",
  "frontend/src/lib/openFoodFactsKey.ts": "Empty file with no content.",
  "frontend/src/lib/portionEstimates.ts": "Maps common serving units (slice, cup, tbsp, etc.) to gram weights, with food-specific overrides for items like eggs, burgers, and pizza, and exports a function to convert a quantity+unit+food combination into grams.",
  "frontend/src/lib/store.ts": "Defines the Zustand persisted global store with types and state for daily study, gym, and food tracking, streaks, body measurements, OLED accent color palette, and goal management.",
  "frontend/src/lib/webSearchNutrition.ts": "Empty file with no content.",
  "frontend/src/main.tsx": "Entry point that mounts the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard page showing today's study, gym, and nutrition summaries, streak, goal progress, and countdowns, with OLED accent color theming.",
  "frontend/src/pages/Description.tsx": "Empty file with no content.",
  "frontend/src/pages/Goals.tsx": "Displays a daily goals checklist (study, gym, nutrition, sleep, discipline) with a progress bar and per-goal glow effects, supporting both normal and OLED accent color modes.",
  "frontend/src/pages/Gym.tsx": "Gym activity logging page that shows today's gym entries and provides a dialog form to add a new workout description, with OLED (crimson) and normal theme support.",
  "frontend/src/pages/Nutrition.tsx": "Nutrition logging page that lists today's food entries and provides a dialog form to add a new food description, with OLED (radioactive green) and normal theme support.",
  "frontend/src/pages/ProtocolMode.tsx": "A fullscreen focus/study session timer with an ascending stopwatch, a long-press SVG ring to terminate and save the session, and a simulated inbound signal overlay demo.",
  "frontend/src/pages/Settings.tsx": "Settings page allowing the user to edit their profile (name, age, gender) and view streak history, with save confirmation and optional OLED border styling.",
  "frontend/src/pages/Study.tsx": "React page for managing daily study topics with add/delete/status-toggle functionality and a Protocol Mode overlay. Supports OLED mode styling with Electric Violet borders and integrates ProtocolModeStartDialog and ProtocolMode components.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom oklch-based colors (neon-green, neon-yellow, card-dark, border-subtle), border radii, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state manifest (version 3) tracking existing implemented features and pending fix requests, including Protocol Mode hold-to-terminate duration fix, onboarding enhancements, settings page, branding removal, and Zustand store updates for age/gender/streakHistory."
}