{
  "backend/main.mo": "Empty Motoko actor defining a placeholder backend canister.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/.env.example": "Example environment file listing optional API keys and Nutritionix/API Ninjas config values.",
  "frontend/CLEAN_REDEPLOY.md": "Guide describing steps to perform a clean rebuild and redeploy of the frontend.",
  "frontend/index.css": "Global Tailwind/CSS variables and dark-theme styling definitions with OKLCH color tokens.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entry point.",
  "frontend/REGRESSION_CHECKLIST.md": "Manual regression testing checklist covering layout, navigation, widgets, and core features.",
  "frontend/scripts/clean-rebuild.sh": "Shell script that deletes build artifacts, reinstalls dependencies, runs checks, and rebuilds the frontend.",
  "frontend/src/App.tsx": "Main React app component that gates access via onboarding and renders pages with bottom navigation.",
  "frontend/src/components/ApiKeySettings.tsx": "Empty placeholder component file.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar component with five tabs and active-page highlighting.",
  "frontend/src/components/CaloriesBurnedApiKeySettings.tsx": "Empty placeholder component file.",
  "frontend/src/components/LiveCalendarWidget.tsx": "Widget showing a live-updating clock, date, and greeting using stored userName.",
  "frontend/src/components/OnboardingGate.tsx": "Interactive onboarding form that collects user name and multiple API keys, validates them, saves to Zustand, and completes onboarding.",
  "frontend/src/components/OpenFoodFactsKeySettings.tsx": "Empty or placeholder file with no content provided.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder export noting that no backend queries are used due to local state management.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining theme variables, custom utilities, and layout components for the app.",
  "frontend/src/lib/apiKey.ts": "Retrieves the DeepSeek API key from Zustand or environment variables.",
  "frontend/src/lib/calories.ts": "Calculates calories burned for gym and cardio using external API, DeepSeek AI, or fallback MET formulas.",
  "frontend/src/lib/caloriesBurnedApi.ts": "Calls an external calories-burned API using an API key and returns parsed calorie data or null on failure.",
  "frontend/src/lib/caloriesBurnedKey.ts": "Gets the API Ninjas key from Zustand or environment variables.",
  "frontend/src/lib/deepseek.ts": "Integrates with DeepSeek's API to fetch exercise and nutrition data and compute calorie estimates via structured prompts.",
  "frontend/src/lib/descriptionFlow.ts": "Parses free‑text food or exercise descriptions using DeepSeek AI with heuristic fallback and returns structured ParsedEntry data.",
  "frontend/src/lib/indianNutrition.ts": "Provides a small Indian nutrition database and a lookup function that returns calorie, protein, and sugar estimates based on quantity.",
  "frontend/src/lib/mealPromptParser.ts": "Extracts multiple food items from meal text by detecting quantities, units, and food keywords, converting them to gram estimates.",
  "frontend/src/lib/mevsa.ts": "Contains the Mevsa nutrition database and lookup plus predefined exercise lists for fitness categories.",
  "frontend/src/lib/nutrition.ts": "Fetches nutrition data using a multi‑tier pipeline: Nutritionix, Indian DB, Mevsa DB, then DeepSeek AI, with a simple fallback estimator.",
  "frontend/src/lib/nutritionix.ts": "Calls the Nutritionix API to fetch detailed nutrition facts for a food query, using app credentials from state or env.",
  "frontend/src/lib/onlineNutrition.ts": "Empty placeholder module for online nutrition logic.",
  "frontend/src/lib/openFoodFactsKey.ts": "Empty placeholder for OpenFoodFacts key handling.",
  "frontend/src/lib/portionEstimates.ts": "Provides default and food-specific portion-to-gram mappings and a function to estimate grams from quantity, unit, and food name.",
  "frontend/src/lib/store.ts": "Implements a Zustand store managing daily study, gym, nutrition data, user settings, and goal tracking with persistence.",
  "frontend/src/lib/webSearchNutrition.ts": "Empty placeholder module for nutrition web search logic.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Renders a dashboard showing today's study, gym, nutrition metrics, streaks, and goals using store data.",
  "frontend/src/pages/Description.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Goals.tsx": "Displays daily goals with progress tracking, allowing manual updates and school attendance toggling.",
  "frontend/src/pages/Gym.tsx": "Shows gym activity summaries including calories and muscle groups, and lists today's logged activities.",
  "frontend/src/pages/Nutrition.tsx": "Displays today's nutrition metrics and lists logged food items using data from the app store.",
  "frontend/src/pages/Study.tsx": "Manages daily study topics, allowing adding, updating status, and deleting topics with dialog UI.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project state, requirements, enabled features, and planned API integrations for the app."
}