{
  "backend/main.mo": "Empty Motoko actor defining a placeholder backend canister.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and recent changes of various frontend files.",
  "frontend/.env.example": "Example environment file showing optional DeepSeek and Google CSE API keys.",
  "frontend/CLEAN_REDEPLOY.md": "Guide explaining how to perform a clean rebuild and redeploy of the frontend.",
  "frontend/index.css": "Global Tailwind CSS configuration defining color variables and base styles for light/dark modes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/REGRESSION_CHECKLIST.md": "Manual regression testing checklist covering layout, navigation, widgets, pages, and data persistence.",
  "frontend/scripts/clean-rebuild.sh": "Script that wipes dependencies and build artifacts, reinstalls packages, and rebuilds the frontend.",
  "frontend/src/App.tsx": "Main React component handling page routing with a 720px canvas layout and bottom navigation.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with six tabs and icon-based page switching.",
  "frontend/src/components/LiveCalendarWidget.tsx": "Widget showing live-updating time and full date breakdown without a calendar grid.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor using Internet Identity and React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication with login, logout, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, custom neon colors, utility classes, and layout components for the app.",
  "frontend/src/lib/calories.ts": "Calculates calories burned for gym or cardio activities using DeepSeek AI with MET-based fallbacks and exports a user profile.",
  "frontend/src/lib/deepseek.ts": "Implements DeepSeek API calls to fetch exercise, nutrition, and calorie data, with JSON-only responses and structured parsing.",
  "frontend/src/lib/descriptionFlow.ts": "Parses user text into structured food or exercise entries using DeepSeek AI with heuristic fallback and calculates calories or nutrition data.",
  "frontend/src/lib/indianNutrition.ts": "Empty module placeholder.",
  "frontend/src/lib/mealPromptParser.ts": "Parses multi-item food descriptions into structured items with quantity and unit handling using pattern matching.",
  "frontend/src/lib/mevsa.ts": "Empty file.",
  "frontend/src/lib/nutrition.ts": "Provides multi-source nutrition lookup with fallbacks, including online APIs, web search, DeepSeek, and a local database.",
  "frontend/src/lib/onlineNutrition.ts": "Fetches nutrition data from Open Food Facts and scales values to the requested quantity.",
  "frontend/src/lib/portionEstimates.ts": "Maps common portion units and food-specific overrides to gram estimates for consistent nutrition calculations.",
  "frontend/src/lib/store.ts": "Defines a Zustand store managing daily study, gym, nutrition, and goal-tracking data with persistence.",
  "frontend/src/lib/webSearchNutrition.ts": "Uses Google Custom Search to extract nutrition facts from search snippets with confidence scoring.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Renders dashboard summarizing daily study, gym, nutrition, and goal progress using stored data.",
  "frontend/src/pages/Description.tsx": "Parses a natural‑language description into food or workout entries, displays the parsed result, and saves it to the store before navigating to the appropriate page.",
  "frontend/src/pages/Goals.tsx": "Shows daily goals with progress, allows toggling completion for manual goals, and tracks whether the user went to school.",
  "frontend/src/pages/Gym.tsx": "Displays today's gym activities with calorie totals and muscle groups, and provides a button to add new entries via description.",
  "frontend/src/pages/Nutrition.tsx": "Shows daily nutrition totals and logged food entries, with an option to add items via description.",
  "frontend/src/pages/Study.tsx": "Manages daily study topics, allowing users to add, update status, or delete topics while showing progress counts.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Defines the project's state, features, and issues related to improving nutrition lookup for restaurant menu items using external search APIs. Notes current parsing limitations and outlines planned integrations and UI updates."
}