{
  "backend/main.mo": "Actor defines a Time type and computes local time of day based on epoch seconds and timezone offset.",
  "feature_evidence.json": "JSON report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short functional summaries for each component or module.",
  "frontend/.env.example": "Example environment file noting no API keys are required for offline operation.",
  "frontend/CLEAN_REDEPLOY.md": "Guide describing when and how to perform a clean rebuild and redeploy of the frontend.",
  "frontend/index.css": "Global Tailwind-based CSS defining color tokens, dark theme variables, and base styling.",
  "frontend/index.html": "HTML entry point loading the React app from main.tsx.",
  "frontend/REGRESSION_CHECKLIST.md": "Manual regression testing checklist covering layout, navigation, widgets, pages, and data behavior.",
  "frontend/scripts/clean-rebuild.sh": "Bash script that deletes build artifacts, reinstalls dependencies, runs checks, and builds the project.",
  "frontend/src/App.tsx": "Main React app component that handles onboarding gating and page navigation with a bottom nav.",
  "frontend/src/components/ApiKeySettings.tsx": "Empty placeholder component for API key settings.",
  "frontend/src/components/ApiNinjasRepromptGate.tsx": "Empty placeholder component for API Ninjas reprompt logic.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with five tabs and icons, calling onNavigate to switch pages.",
  "frontend/src/components/CaloriesBurnedApiKeySettings.tsx": "Empty placeholder component for calories API key settings.",
  "frontend/src/components/HeaderMeasurements.tsx": "Component displaying weekly and monthly body measurements from the store.",
  "frontend/src/components/LiveCalendarWidget.tsx": "Auto-updating time and date widget showing 24-hour time and full date breakdown.",
  "frontend/src/components/OnboardingGate.tsx": "User onboarding form that captures a name, validates it, and triggers onboarding completion via the app store.",
  "frontend/src/components/OpenFoodFactsKeySettings.tsx": "Empty placeholder component file.",
  "frontend/src/components/ParsedMealPreview.tsx": "Displays parsed meal items with calories, macros, and totals using styled UI components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context and logic for login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Empty file noting that Zustand handles state instead of backend queries.",
  "frontend/src/hooks/useResultCountdowns.ts": "Hook that computes and updates weekly and monthly countdown values based on the user's start timestamp.",
  "frontend/src/index.css": "Tailwind configuration defining global styles, color variables, utilities, and layout constraints.",
  "frontend/src/lib/apiKey.ts": "Empty API key module placeholder.",
  "frontend/src/lib/calories.ts": "Provides calorie burn calculations for cardio and gym activities using MET values and simple heuristics.",
  "frontend/src/lib/caloriesBurnedApi.ts": "Empty placeholder for a calories‑burned API module.",
  "frontend/src/lib/caloriesBurnedKey.ts": "Empty placeholder for a calories‑burned key module.",
  "frontend/src/lib/countdowns.ts": "Utility functions computing days remaining in weekly and monthly cycles based on a start timestamp.",
  "frontend/src/lib/deepseek.ts": "Empty placeholder for DeepSeek‑related logic.",
  "frontend/src/lib/descriptionFlow.ts": "Parses meal descriptions locally and enriches entries with nutrition data from local estimators and databases.",
  "frontend/src/lib/indianNutrition.ts": "Defines an Indian food nutrition database and a lookup function with exact and partial matching.",
  "frontend/src/lib/mealPromptParser.ts": "Parses free‑text meal prompts into structured food items with estimated gram quantities.",
  "frontend/src/lib/mevsa.ts": "Contains a general nutrition database, lookup function, and partial exercise list for Mevsa.",
  "frontend/src/lib/nutrition.ts": "Fetches nutrition data by querying Indian and Mevsa databases with a fallback estimator.",
  "frontend/src/lib/nutritionix.ts": "Empty placeholder file for Nutritionix integration.",
  "frontend/src/lib/onlineNutrition.ts": "Empty placeholder file for online nutrition lookups.",
  "frontend/src/lib/openFoodFactsKey.ts": "Empty placeholder for OpenFoodFacts API key or config.",
  "frontend/src/lib/portionEstimates.ts": "Provides default and food‑specific unit‑to‑gram conversions for portion estimation.",
  "frontend/src/lib/store.ts": "Zustand store managing daily data, goals, food entries, gym activities, and user settings.",
  "frontend/src/lib/webSearchNutrition.ts": "Empty placeholder for web search–based nutrition data.",
  "frontend/src/main.tsx": "Root React entry point setting up providers and rendering the application.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard showing streaks, study/gym/nutrition stats, goals, and widgets using store data.",
  "frontend/src/pages/Description.tsx": "Empty file with no implementation.",
  "frontend/src/pages/Goals.tsx": "Displays daily goals with completion tracking, progress bar, and school toggle, updating state via the store.",
  "frontend/src/pages/Gym.tsx": "Manages gym and cardio activity logging with a dialog form, calculating calories and storing activities.",
  "frontend/src/pages/Nutrition.tsx": "Handles food entry logging with optional nutrition lookup and shows total calories, protein, and sugar consumed.",
  "frontend/src/pages/Study.tsx": "Allows adding, updating, and categorizing study topics while showing progress across done, pending, and later states.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, animations, and plugin setup for the project.",
  "project_state.json": "Tracks project metadata, existing features, and a pending UI update request involving greeting placement and countdown indicators. Contains version info, feature entries, and project configuration flags."
}