{
  "backend/main.mo": "Empty Motoko actor module with no logic.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and styling updates of various frontend files.",
  "frontend/index.css": "Tailwind base styles plus dark/neon OKLCH variable definitions and global utility applications.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component handling page navigation and wrapping content in a forced-dark ThemeProvider.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with five icon buttons and compact minimalist styling.",
  "frontend/src/components/LiveCalendarWidget.tsx": "Live-updating time/date display with a compact month grid highlighting the current day.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive React context managing Internet Identity login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file since Zustand handles all data without backend queries.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, dark mode values, and custom utility/component classes including neon color styles.",
  "frontend/src/lib/calories.ts": "Provides calorie calculation using DeepSeek AI with fallback formulas for gym and cardio activities.",
  "frontend/src/lib/deepseek.ts": "Implements DeepSeek API calls and wrappers for exercise and nutrition data, including calorie estimators.",
  "frontend/src/lib/indianNutrition.ts": "Empty placeholder module for Indian nutrition data.",
  "frontend/src/lib/mevsa.ts": "Empty placeholder module for MEVSA functionality.",
  "frontend/src/lib/nutrition.ts": "Fetches nutrition data using DeepSeek with a fallback 100g nutrition database and local calculation logic.",
  "frontend/src/lib/store.ts": "Zustand store managing daily data, study topics, gym activities, nutrition entries, and goal/streak tracking.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and loads global CSS.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page computing and displaying daily study, gym, nutrition, calorie, and goals metrics.",
  "frontend/src/pages/Goals.tsx": "Renders daily goals with progress, auto-tracked states, and a school attendance toggle affecting calories.",
  "frontend/src/pages/Gym.tsx": "Manages gym and cardio activity logging with calorie calculations and displays total burned calories and muscles trained.",
  "frontend/src/pages/Nutrition.tsx": "Allows adding food entries with fetched nutrition data and shows total intake, burned calories, and net calories.",
  "frontend/src/pages/Study.tsx": "Handles creation and status updates of study topics, showing progress across done, pending, and later categories.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, animations, and extended theme settings for the app's neon aesthetic.",
  "project_state.json": "Tracks project requirements and existing features for adding a compact real-time calendar widget and related UI refinements."
}