{
  "backend/main.mo": "Empty Motoko actor with no methods defined.",
  "feature_evidence.json": "JSON report listing implemented features, related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of frontend file summaries describing UI structure, state management, utilities, and new description‑based logging flow.",
  "frontend/CLEAN_REDEPLOY.md": "Guide outlining steps for performing a clean rebuild and redeploy of the frontend.",
  "frontend/index.css": "Global Tailwind‑based style definitions with OKLCH dark theme variables and base styling rules.",
  "frontend/index.html": "Base HTML file mounting the app root and loading the main TypeScript entrypoint.",
  "frontend/REGRESSION_CHECKLIST.md": "Regression testing checklist covering layout, navigation, widgets, pages, and data persistence.",
  "frontend/scripts/clean-rebuild.sh": "Shell script that removes build artifacts, reinstalls dependencies, runs type checks, and rebuilds the project.",
  "frontend/src/App.tsx": "Main React component handling page state, theme setup, and rendering pages with bottom navigation.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar component defining six page tabs and handling navigation clicks.",
  "frontend/src/components/LiveCalendarWidget.tsx": "Live time and date widget that updates every second and displays formatted time and full date.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor, reacting to identity changes, and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider to manage Internet Identity authentication, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend query hooks are used.",
  "frontend/src/index.css": "Defines Tailwind base, custom theme variables, utility classes, and layout styles for the app.",
  "frontend/src/lib/calories.ts": "Calculates calories burned for gym and cardio using DeepSeek AI with MET-based fallback and exports the user profile.",
  "frontend/src/lib/deepseek.ts": "Implements DeepSeek API calls for exercise and nutrition data, including calorie calculations and structured responses.",
  "frontend/src/lib/descriptionFlow.ts": "Parses free‑text descriptions into structured entries using DeepSeek when available with heuristic fallback.",
  "frontend/src/lib/indianNutrition.ts": "Empty module reserved for Indian nutrition data.",
  "frontend/src/lib/mealPromptParser.ts": "Parses multi‑item meal text into structured food items using pattern matching and portion estimation.",
  "frontend/src/lib/mevsa.ts": "Empty placeholder file.",
  "frontend/src/lib/nutrition.ts": "Provides nutrition lookup via online API, DeepSeek AI, or local database with fallbacks and scaling by quantity.",
  "frontend/src/lib/onlineNutrition.ts": "Fetches nutrition data from Open Food Facts, extracts per‑100g values, and scales them to the given quantity.",
  "frontend/src/lib/portionEstimates.ts": "Converts portion units into gram estimates using default and food-specific mappings.",
  "frontend/src/lib/store.ts": "Defines Zustand store for daily study, gym, and food tracking data with actions and persistence.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Renders dashboard showing daily progress for study, gym, nutrition, calories, and goals.",
  "frontend/src/pages/Description.tsx": "Parses user descriptions into structured entries, enriches them, and saves gym or food data to the store.",
  "frontend/src/pages/Goals.tsx": "Displays daily goals with progress, auto-tracked status, and manual checkboxes, plus a toggle for school attendance.",
  "frontend/src/pages/Gym.tsx": "Shows today's gym stats and logged activities, with calories, muscles trained, and an option to add workouts via description.",
  "frontend/src/pages/Nutrition.tsx": "Presents daily nutrition totals and food entries with calories, macros, and a button to add meals via description.",
  "frontend/src/pages/Study.tsx": "Manages study topics with add, status updates, and categorized progress (done, pending, later).",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and theming for the app's UI.",
  "project_state.json": "Defines current project state, features, issues, and requirements for enhancing nutrition parsing and lookup workflows."
}