{
  "backend/main.mo": "Motoko actor defining a Time type and a function that computes time-of-day seconds adjusted for timezone.",
  "feature_evidence.json": "Feature evidence report listing dashboard measurement display rules tied to HeaderMeasurements.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries for many frontend source files describing their purpose and behavior.",
  "frontend/.env.example": "Example environment file noting no external API keys are required.",
  "frontend/CLEAN_REDEPLOY.md": "Guide explaining steps for performing a clean rebuild and redeploy of the frontend app.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and dark mode theming.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/REGRESSION_CHECKLIST.md": "Regression testing checklist covering layout, navigation, widgets, pages, and data persistence.",
  "frontend/scripts/clean-rebuild.sh": "Shell script that deletes build artifacts, reinstalls dependencies, type-checks, and rebuilds the frontend.",
  "frontend/src/App.tsx": "Main React app component handling onboarding gating and page navigation within a themed 720px canvas.",
  "frontend/src/components/ApiKeySettings.tsx": "Empty placeholder component file.",
  "frontend/src/components/ApiNinjasRepromptGate.tsx": "Empty placeholder component file.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation component with five tabs and icon-based navigation state handling.",
  "frontend/src/components/CaloriesBurnedApiKeySettings.tsx": "Empty placeholder component file.",
  "frontend/src/components/HeaderMeasurements.tsx": "Displays weekly and monthly measurement grids and collapses entirely when no data exists.",
  "frontend/src/components/LiveCalendarWidget.tsx": "Real-time greeting and date/time widget with a calendar button and second-by-second updates.",
  "frontend/src/components/MeasurementsEditorDialog.tsx": "Dialog component for editing weekly and monthly body measurements with local drafts and save/cancel handling.",
  "frontend/src/components/OnboardingGate.tsx": "Onboarding screen that collects a user's name, validates it, and completes onboarding through the app store.",
  "frontend/src/components/OpenFoodFactsKeySettings.tsx": "Empty placeholder component file.",
  "frontend/src/components/ParsedMealPreview.tsx": "Displays parsed meal items with calories, macros, and totals in a styled preview layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty file noting that Zustand replaces backend queries.",
  "frontend/src/hooks/useResultCountdowns.ts": "Hook that computes and updates weekly and monthly countdowns every minute based on user start time.",
  "frontend/src/index.css": "Tailwind base and custom theme variables defining neon color scheme and UI utility classes.",
  "frontend/src/lib/apiKey.ts": "Empty placeholder file for API key handling.",
  "frontend/src/lib/calories.ts": "Provides MET‑based cardio calorie calculations and a fallback gym calorie formula using user profile constants.",
  "frontend/src/lib/caloriesBurnedApi.ts": "Empty placeholder file for calorie API logic.",
  "frontend/src/lib/caloriesBurnedKey.ts": "Empty placeholder file for calorie API key handling.",
  "frontend/src/lib/countdowns.ts": "Provides functions to compute remaining days in user-based weekly and monthly cycles with fallbacks when no start timestamp exists.",
  "frontend/src/lib/deepseek.ts": "Empty placeholder file.",
  "frontend/src/lib/descriptionFlow.ts": "Parses a food description into items and enriches them with locally sourced nutrition data.",
  "frontend/src/lib/indianNutrition.ts": "Contains an Indian food nutrition database and logic to retrieve nutrition data via exact or partial matching.",
  "frontend/src/lib/mealPromptParser.ts": "Parses meal text into multiple food items by detecting quantities, units, and food names, converting them to gram estimates.",
  "frontend/src/lib/mevsa.ts": "Provides a general nutrition database with lookup logic plus partial exercise listings.",
  "frontend/src/lib/nutrition.ts": "Fetches nutrition data using Indian and Mevsa databases with a simple fallback estimator.",
  "frontend/src/lib/nutritionix.ts": "Empty placeholder file.",
  "frontend/src/lib/onlineNutrition.ts": "Empty placeholder file.",
  "frontend/src/lib/openFoodFactsKey.ts": "Empty placeholder file.",
  "frontend/src/lib/portionEstimates.ts": "Converts portions and units into gram estimates using defaults and food-specific overrides.",
  "frontend/src/lib/store.ts": "Defines Zustand store with persistent daily data, activity/food tracking, goals, streaks, and measurement state plus helper initializers.",
  "frontend/src/lib/webSearchNutrition.ts": "Empty placeholder file for nutrition web search logic.",
  "frontend/src/main.tsx": "Bootstraps React app with React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing today’s stats including study, gym, nutrition, calories, goals, streak, and countdowns.",
  "frontend/src/pages/Description.tsx": "Empty placeholder page file.",
  "frontend/src/pages/Goals.tsx": "Displays daily goals with completion state and allows toggling goals and school attendance.",
  "frontend/src/pages/Gym.tsx": "Gym page for adding gym or cardio activities, calculating calories, and listing daily totals.",
  "frontend/src/pages/Nutrition.tsx": "Nutrition page for adding or auto‑fetching food entries and showing daily nutrition totals.",
  "frontend/src/pages/Study.tsx": "React page for managing daily study topics with add, update status, and delete actions using app store state.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing state, existing features, and a pending request related to removing 'No data yet' labels."
}