{
  "kind": "build_request",
  "title": "Move weekly/monthly result indicators into greeting next to user name",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Dashboard header so the user name line displays a greeting in English as \"Hello, <name>\" with a small icon/sign placed next to the greeting text (e.g., a Lucide icon), instead of showing only the raw name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "now put sign asid my name hello,name"
        ]
      },
      "acceptanceCriteria": [
        "On the Dashboard page header, the user name is shown as \"Hello, <name>\" (with the stored onboarding name)",
        "A small icon/sign is rendered adjacent to the greeting text on the same line",
        "No other part of the Dashboard shows the raw name alone in the header area"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Move the weekly and monthly result countdown indicators (e.g., \"X days before weekly result\" and \"Y days before monthly result\") into the same greeting section next to/under \"Hello, <name>\" in the Dashboard header, and remove the existing weekly/monthly countdown indicators that are currently displayed below the app name section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "put weekly and monthly rsult inside it and remove it below the app name"
        ]
      },
      "acceptanceCriteria": [
        "The weekly and monthly countdown indicators are displayed within the greeting section that contains \"Hello, <name>\"",
        "The separate \"Countdown Indicators\" block that appears below the app name (Nuvio) is removed from the Dashboard layout",
        "Weekly and monthly countdown values continue to use the existing countdown logic (no change in computed numbers), only their placement changes"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Avoid duplicate greetings by ensuring only one greeting is shown on the Dashboard screen (either in the Dashboard header or inside the LiveCalendarWidget), keeping the greeting located where the user requested (next to the name in the Dashboard header).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "now put sign asid my name hello,name"
        ]
      },
      "acceptanceCriteria": [
        "On the Dashboard screen, \"Hello, <name>\" appears only once",
        "The LiveCalendarWidget continues to show time and date correctly after greeting duplication is removed"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only components must be composed, not edited)."
  ],
  "nonGoals": [
    "Do not add new pages or forms for entering weekly/monthly measurement data as part of this change.",
    "Do not change the countdown calculation rules or measurement data models; only update the UI placement/presentation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}