{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dashboard header greeting: add icon and move weekly/monthly countdowns; remove duplicate greeting",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Change Dashboard header name line to an English greeting \"Hello, <name>\" with a small adjacent icon, replacing the raw name display.",
      "acceptanceCriteria": [
        "On the Dashboard page header, the user name is shown as \"Hello, <name>\" (with the stored onboarding name)",
        "A small icon/sign is rendered adjacent to the greeting text on the same line",
        "No other part of the Dashboard shows the raw name alone in the header area"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Replace the raw {userName} header line with a greeting line formatted as \"Hello, {userName}\" and render a small Lucide icon adjacent to the greeting text (same line). Ensure no other header element renders the raw name alone."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Relocate weekly/monthly countdown indicators into the Dashboard greeting section and remove the existing countdown block below the app name.",
      "acceptanceCriteria": [
        "The weekly and monthly countdown indicators are displayed within the greeting section that contains \"Hello, <name>\"",
        "The separate \"Countdown Indicators\" block that appears below the app name (Nuvio) is removed from the Dashboard layout",
        "Weekly and monthly countdown values continue to use the existing countdown logic (no change in computed numbers), only their placement changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Move the UI rendering of weekly/monthly countdown indicators (using existing values from useResultCountdowns) into the same greeting section as \"Hello, <name>\" (next to or under it). Remove the existing standalone \"Countdown Indicators\" block currently rendered below the app name area, without changing countdown computation logic."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure only one Dashboard greeting is shown by removing the greeting from LiveCalendarWidget while keeping time/date intact.",
      "acceptanceCriteria": [
        "On the Dashboard screen, \"Hello, <name>\" appears only once",
        "The LiveCalendarWidget continues to show time and date correctly after greeting duplication is removed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LiveCalendarWidget.tsx",
          "operation": "modify",
          "description": "Remove (or disable) the greeting display from LiveCalendarWidget so the Dashboard shows \"Hello, <name>\" only in the Dashboard header greeting section. Keep the live time and full date rendering behavior unchanged."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Verify the Dashboard renders exactly one greeting (in the header greeting section) after updating LiveCalendarWidget, and that the remaining LiveCalendarWidget still displays time/date correctly in the Dashboard layout."
        }
      ]
    }
  ]
}