{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve free-text restaurant meal parsing and optional web-search nutrition fallback",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Improve free-text parsing to keep multi-word restaurant/menu item names intact and default to realistic per-piece portions for burger-like foods.",
      "acceptanceCriteria": [
        "Entering \"2 kfc veg zinger burger\" results in a parsed food item whose name includes \"kfc\" and \"veg zinger burger\" (not truncated to only the first 2–3 words).",
        "The parser treats \"2 <menu item>\" as 2 pieces (not 2g) when no explicit unit is provided.",
        "Portion estimation for burger-like items defaults to a higher per-piece gram estimate than the generic 50g piece (so total grams for 2 burgers is plausibly >100g)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/mealPromptParser.ts",
          "operation": "modify",
          "description": "Update parsing heuristics so number-led items can capture longer multi-word names (e.g., restaurant + menu item) without the current 3-word truncation, while still supporting multi-item inputs separated by additional quantities/conjunctions."
        },
        {
          "path": "frontend/src/lib/portionEstimates.ts",
          "operation": "modify",
          "description": "Adjust portion estimation so missing-unit quantities default to pieces, and add burger-like per-piece gram overrides (e.g., burger/zinger/sandwich) to produce plausible totals for restaurant items."
        },
        {
          "path": "frontend/src/lib/descriptionFlow.ts",
          "operation": "modify",
          "description": "Ensure heuristic food parsing uses the improved meal prompt parser output for single-item cases (including restaurant/menu items) and keeps the computed per-piece gram quantity for downstream nutrition scaling."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an optional Google Custom Search-based nutrition lookup step after Open Food Facts not-found and before DeepSeek/local fallback, configured via environment variables.",
      "acceptanceCriteria": [
        "If Open Food Facts returns not-found for a query like \"KFC veg zinger burger\", the app attempts a web-search-based lookup next.",
        "The web-search integration is configurable via environment variables (do not hardcode keys in source).",
        "When the search API is not configured or fails, the app continues gracefully to the existing DeepSeek/local fallback without breaking the UI.",
        "The nutrition result includes an explicit nutritionSource value that distinguishes search-based results from 'online' (Open Food Facts), 'deepseek', and 'local'."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/webSearchNutrition.ts",
          "operation": "create",
          "description": "Implement a web-search-based nutrition provider that calls Google Custom Search JSON API when configured, returning a structured result (including a confidence indicator) derived from search results/snippets. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/nutrition.ts",
          "operation": "modify",
          "description": "Insert the new web-search provider into the fallback chain (after Open Food Facts not-found, before DeepSeek/local), read configuration from import.meta.env, and extend NutritionData.nutritionSource to include a distinct 'web-search' value."
        },
        {
          "path": "frontend/src/lib/descriptionFlow.ts",
          "operation": "modify",
          "description": "Update types for nutritionSource in ParsedEntry/foodItems to include 'web-search' and propagate it from fetchNutritionData into enriched results."
        },
        {
          "path": "frontend/.env.example",
          "operation": "create",
          "description": "Document optional environment variables for the web-search lookup (e.g., VITE_GOOGLE_CSE_API_KEY and VITE_GOOGLE_CSE_CX) and note that the feature is disabled when unconfigured."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Extract calories (and protein/sugar when available) from web-search snippets using unit-aware heuristics and scale results to the parsed quantity, falling back when confidence is low.",
      "acceptanceCriteria": [
        "For a search snippet containing a calories value (e.g., \"450 kcal\"), the app can parse and populate calories for the item.",
        "If protein is present in the snippet (e.g., \"25g protein\"), the app parses and populates protein; if absent, protein can remain 0.",
        "Parsed per-item nutrition is scaled to the final gram quantity that the parser/portion estimator computes for the entry.",
        "If parsing yields ambiguous/low-confidence values, the app does not present them as definitive; it should fall back to the next provider (DeepSeek/local) rather than saving incorrect numbers."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/webSearchNutrition.ts",
          "operation": "modify",
          "description": "Add robust, unit-aware snippet parsing heuristics (kcal/calories, grams; optionally handle kJ→kcal) and a confidence/validity check so ambiguous values return no usable result (triggering fallback) rather than being surfaced as definitive. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/nutrition.ts",
          "operation": "modify",
          "description": "Ensure web-search-derived nutrition is only used when snippet parsing reports sufficient confidence, and scale parsed nutrition to the final gram quantity computed by the parser/portion estimator for the entry."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update Quick Log (Description) results UI to clearly label nutrition source as Web Search vs Online DB vs AI vs Estimated, in English, without affecting gym/cardio flows.",
      "acceptanceCriteria": [
        "For single-item and multi-item food results, the UI shows a source badge that includes a distinct label for the new search-based provider (e.g., \"Web Search\"), separate from existing badges.",
        "All user-facing text for the new provider is in English.",
        "The UI continues to work for gym/cardio entries unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Description.tsx",
          "operation": "modify",
          "description": "Extend the nutrition source badge mapping to include a distinct English label for 'web-search' (e.g., \"Web Search\") and keep existing badges unchanged for online/deepseek/local; ensure gym/cardio rendering remains unaffected."
        },
        {
          "path": "frontend/src/lib/descriptionFlow.ts",
          "operation": "modify",
          "description": "Align any frontend-facing type unions and value wiring so the UI can reliably render the new 'web-search' nutritionSource badge for both single-item and multi-item food results."
        }
      ]
    }
  ]
}