{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Portion-aware multi-item meal parsing with online nutrition lookup and Chrome-like breakdown UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Parse free-text meal prompts into multiple food items with portion-aware unit handling (slices/packets/tablespoons/grams) instead of defaulting to 100g.",
      "acceptanceCriteria": [
        "Given input like \"2 cheese slice\", the parsed food quantity shown in the UI is based on a slice-to-grams estimate (not 100g by default).",
        "Given input like \"10 gram mayonnaise\", the parsed quantity remains 10g (no conversion/guessing needed).",
        "If the prompt includes multiple food items (e.g., \"2 maggie 2 cheese slice 10 gram mayannaise\"), the parser extracts all items instead of collapsing into a single food entry."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/mealPromptParser.ts",
          "operation": "create",
          "description": "Create a dedicated meal prompt parser that extracts multiple items by recognizing repeating quantity+unit+food-name segments, preserving both the interpreted grams and the original unit display (e.g., \"2 slices\")."
        },
        {
          "path": "frontend/src/lib/portionEstimates.ts",
          "operation": "create",
          "description": "Add portion-to-grams estimates for common units (slice, packet, tablespoon, teaspoon, cup, serving) with food-aware overrides (e.g., cheese slice → grams, Maggi packet → grams), used only when the prompt unit is not already grams/ml."
        },
        {
          "path": "frontend/src/lib/descriptionFlow.ts",
          "operation": "modify",
          "description": "Update food parsing to use the new meal prompt parser for heuristic parsing, returning a multi-item food result structure (items array + totals-ready fields) while keeping gym/cardio parsing behavior unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a public, keyless online nutrition lookup step (e.g., Open Food Facts search) before DeepSeek/local fallback and track nutrition source in the enriched results.",
      "acceptanceCriteria": [
        "When an item can be matched via a public nutrition endpoint (e.g., Open Food Facts), the app uses those values rather than the local fallback DB.",
        "If online lookup fails or returns no match, the app continues to work and uses the existing DeepSeek/local fallback logic without crashing.",
        "The enrichment pipeline clearly tracks whether numbers are from online lookup vs fallback (internally and/or as a small UI note)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/onlineNutrition.ts",
          "operation": "create",
          "description": "Implement a keyless public nutrition fetcher that tries to match a query to public sources (such as Open Food Facts) and returns normalized calories/protein/sugar plus an explicit source label (e.g., \"online\")."
        },
        {
          "path": "frontend/src/lib/nutrition.ts",
          "operation": "modify",
          "description": "Adjust nutrition enrichment pipeline ordering to try online lookup first, then existing DeepSeek logic (when configured), and finally the local nutrition DB; extend return shape to include a nutritionSource field for UI/internal tracking."
        },
        {
          "path": "frontend/src/pages/Description.tsx",
          "operation": "modify",
          "description": "Display a small per-item note (or badge-like text) indicating whether nutrition came from online lookup vs DeepSeek vs local fallback; ensure the note is in English and does not block saving."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update Quick Log (Description) results UI to show a Chrome-like itemized breakdown with interpreted quantities, per-item macros, and totals.",
      "acceptanceCriteria": [
        "For multi-item input, the results screen shows a per-item list (e.g., Maggi x2, cheese slice x2, mayonnaise 10g) with calories and protein per item and totals at the bottom.",
        "The totals match the sum of the displayed per-item values.",
        "All user-facing labels and summaries are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Description.tsx",
          "operation": "modify",
          "description": "Replace the single-food grid UI with a food-results renderer that supports both single-item and multi-item meals: show an itemized list with interpreted quantity (original unit + grams), calories/protein/sugar (when available), and a totals section whose values are computed from the displayed items."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Enrich multiple parsed food items in one prompt, generate an English bullet-like summary with totals, and keep saved data consistent with what the UI shows.",
      "acceptanceCriteria": [
        "A single prompt containing multiple foods results in enrichment of each item and a combined summary string that includes itemized estimates and a total calories/protein line.",
        "The existing Save flow still works (no runtime errors), and saved entries reflect the enriched calories/protein/sugar values used in the UI.",
        "If only one food is entered, the UI and save behavior remain sensible and similar to current behavior (single-item display is acceptable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/descriptionFlow.ts",
          "operation": "modify",
          "description": "Update food enrichment to enrich each parsed food item, compute per-item macros and meal totals, and generate a combined English summary string (itemized lines + totals) while preserving compatibility for non-food types."
        },
        {
          "path": "frontend/src/pages/Description.tsx",
          "operation": "modify",
          "description": "Update confirm-and-save behavior for multi-item meals to save one food entry per recognized item using the enriched values shown in the UI, while keeping single-item save behavior consistent with current flow (no runtime errors)."
        }
      ]
    }
  ]
}