{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Hide 'No data yet' in Dashboard header measurements and collapse empty row",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the Weekly measurements fallback text so only the 'Weekly' label remains when there is no weekly data.",
      "acceptanceCriteria": [
        "When weekly measurements contain no values > 0, the Dashboard header does not display the text \"No data yet\" anywhere under the \"Weekly\" label.",
        "The \"Weekly\" label itself remains visible (unless it is intentionally hidden by REQ-3)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeaderMeasurements.tsx",
          "operation": "modify",
          "description": "Adjust Weekly rendering logic to not render the \"No data yet\" fallback when weekly measurements have no values > 0; keep the \"Weekly\" label visible when Monthly has data."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the Monthly measurements fallback text so only the 'Monthly' label remains when there is no monthly data.",
      "acceptanceCriteria": [
        "When monthly measurements contain no values > 0, the Dashboard header does not display the text \"No data yet\" anywhere under the \"Monthly\" label.",
        "The \"Monthly\" label itself remains visible (unless it is intentionally hidden by REQ-3)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeaderMeasurements.tsx",
          "operation": "modify",
          "description": "Adjust Monthly rendering logic to not render the \"No data yet\" fallback when monthly measurements have no values > 0; keep the \"Monthly\" label visible when Weekly has data."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Collapse the Dashboard header measurements row when both Weekly and Monthly have no data so no empty gap is shown.",
      "acceptanceCriteria": [
        "With no weekly data and no monthly data, the Dashboard does not show empty measurement containers/spacers below the header row, and the next section starts immediately after the header block with normal spacing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeaderMeasurements.tsx",
          "operation": "modify",
          "description": "When both Weekly and Monthly measurements contain no values > 0, render nothing (return null) so the measurements row collapses to minimal/zero height and does not leave a placeholder gap on the Dashboard."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Ensure the header block spacing remains correct when HeaderMeasurements renders nothing (no extra spacer/gap introduced by the measurements row)."
        }
      ]
    }
  ]
}